geomatsi/mcu-tests/esp32-tests/cam-test/sdkconfig.defaults
# default target: esp32cam
CONFIG_IDF_TARGET_ARCH_XTENSA=y
CONFIG_IDF_TARGET_ARCH="xtensa"
CONFIG_IDF_TARGET="esp32"
CONFIG_IDF_TARGET_ESP32=y

# custom options: wifi
CONFIG_EXAMPLE_SCAN_LIST_SIZE=10
CONFIG_EXAMPLE_WIFI_SSID="test"
CONFIG_EXAMPLE_WIFI_PASS="test"

# custom options: data partition on spi flash
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="storage.csv"
CONFIG_PARTITION_TABLE_FILENAME="storage.csv"

# httpd: increase request size to handle post 
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024

# esp32-camera requirements
CONFIG_SPIRAM_SUPPORT=y
CONFIG_ESP32_SPIRAM_SUPPORT=y
CONFIG_SPIRAM_SPEED_80M=y

# flash led pin
CONFIG_FLASH_LED_PIN=4
